_posts/productivity/2013-09-27-export-org-file-to-other-folder.html
---
layout: post
title: export .org to .html file in other folder
categories: [productivity]
tags: [emacs, org-mode]
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Problem</h2>
<div class="outline-text-2" id="text-1">
<p>
The <code>org-expoort-dispatch</code> command is very useful when I'm writing <code>.org</code> file and want to preview the exported <code>.html</code> file in web browser. The manual is copied from emacs on-line help:
</p>
<pre class="example">
It is bound to C-c C-e, &lt;menu-bar&gt; &lt;Org&gt; &lt;Export/Publish...&gt;.

(org-export-dispatch &amp;optional ARG)

Export dispatcher for Org mode.

It provides an access to common export related tasks in a buffer.
Its interface comes in two flavours: standard and expert.
</pre>

<p>
Whenever I want to preview the article, I just press <code>C-c C-e h o</code>, emacs will convert the <code>.org</code> file to <code>.html</code> file and open it in my default web browser.
</p>

<p>
But the problem is that the result <code>.html</code> file is stored at the same folder as <code>.org</code> file. I've been looking for the solution around the web, the emacs geeks just told us to look at <code>org-publish-project-alist</code>. But what I know is that <code>org-publish-project-alist</code> is used to set up a publish project and it is used to publish whole project to a destination folder. 
</p>

<p>
This is not what I'm looking for.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Solution</h2>
<div class="outline-text-2" id="text-2">
<p>
After several try, I found that in the <code>.html</code> export backend, <code>org-export-output-file-name</code> is used to generated the output file as following code:
</p>

<div class="org-src-container">

<pre class="src src-lisp"><span class="linenr"> 1: </span>(<span style="color: #8b008b; font-weight: bold;">defun</span> <span style="color: #0000cd;">org-html-export-to-html</span>
<span class="linenr"> 2: </span>  (<span style="color: #551a8b;">&amp;optional</span> async subtreep visible-only body-only ext-plist)
<span class="linenr"> 3: </span>  (interactive)
<span class="linenr"> 4: </span>  (<span style="color: #8b008b; font-weight: bold;">let*</span> ((extension (concat <span style="color: #3a5fcd;">"."</span> org-html-extension))
<span class="linenr"> 5: </span>     (file (org-export-output-file-name extension subtreep))
<span class="linenr"> 6: </span>     (org-export-coding-system org-html-coding-system))
<span class="linenr"> 7: </span>    (<span style="color: #8b008b; font-weight: bold;">if</span> async
<span class="linenr"> 8: </span>    (org-export-async-start
<span class="linenr"> 9: </span>        (<span style="color: #8b008b; font-weight: bold;">lambda</span> (f) (org-export-add-to-stack f 'html))
<span class="linenr">10: </span>      (<span style="color: #8b008b; font-weight: bold;">let</span> ((org-export-coding-system org-html-coding-system))
<span class="linenr">11: </span>        `(expand-file-name
<span class="linenr">12: </span>          (org-export-to-file
<span class="linenr">13: </span>           'html ,file ,subtreep ,visible-only ,body-only ',ext-plist))))
<span class="linenr">14: </span>      (<span style="color: #8b008b; font-weight: bold;">let</span> ((org-export-coding-system org-html-coding-system))
<span class="linenr">15: </span>    (org-export-to-file
<span class="linenr">16: </span>     'html file subtreep visible-only body-only ext-plist)))))
</pre>
</div>

<p>
While <code>org-export-output-file-name</code> can accept three parameter:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #8b008b; font-weight: bold;">defun</span> <span style="color: #0000cd;">org-export-output-file-name</span> (extension <span style="color: #551a8b;">&amp;optional</span> subtreep pub-dir)
</pre>
</div>

<p>
When optional argument PUB-DIR is set, use it as the publishing directory. 
</p>

<p>
Thus change line 5 of <code>org-html-export-to-html</code> function, add the third paramter <code>~/exports/</code>:
</p>

<div class="org-src-container">

<pre class="src src-lisp"><span class="linenr"> 1: </span>(<span style="color: #8b008b; font-weight: bold;">defun</span> <span style="color: #0000cd;">org-html-export-to-html</span>
<span class="linenr"> 2: </span>  (<span style="color: #551a8b;">&amp;optional</span> async subtreep visible-only body-only ext-plist)
<span class="linenr"> 3: </span>  (interactive)
<span class="linenr"> 4: </span>  (<span style="color: #8b008b; font-weight: bold;">let*</span> ((extension (concat <span style="color: #3a5fcd;">"."</span> org-html-extension))
<span class="linenr"> 5: </span>     (file (org-export-output-file-name extension subtreep <span style="color: #3a5fcd;">"~/exports/"</span>))
<span class="linenr"> 6: </span>     (org-export-coding-system org-html-coding-system))
<span class="linenr"> 7: </span>    (<span style="color: #8b008b; font-weight: bold;">if</span> async
<span class="linenr"> 8: </span>    (org-export-async-start
<span class="linenr"> 9: </span>        (<span style="color: #8b008b; font-weight: bold;">lambda</span> (f) (org-export-add-to-stack f 'html))
<span class="linenr">10: </span>      (<span style="color: #8b008b; font-weight: bold;">let</span> ((org-export-coding-system org-html-coding-system))
<span class="linenr">11: </span>        `(expand-file-name
<span class="linenr">12: </span>          (org-export-to-file
<span class="linenr">13: </span>           'html ,file ,subtreep ,visible-only ,body-only ',ext-plist))))
<span class="linenr">14: </span>      (<span style="color: #8b008b; font-weight: bold;">let</span> ((org-export-coding-system org-html-coding-system))
<span class="linenr">15: </span>    (org-export-to-file
<span class="linenr">16: </span>     'html file subtreep visible-only body-only ext-plist)))))
</pre>
</div>

<p>
Fantastique, now when you press <code>C-c C-e h o</code>, emacs will save the <code>.html</code> file in <code>~/exports/</code> and open it in web browser for your preview.
</p>

<p>
For other kind of export, I think this method could also be applied. Good luck.
</p>
</div>
</div>
